Revit 2027 API
IDataConversionMonitor.GetVerbosity Method
 Reports requested verbosity level
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
DataExchangeMessageVerbosity GetVerbosity()
Function GetVerbosity As DataExchangeMessageVerbosity
DataExchangeMessageVerbosity GetVerbosity()
abstract GetVerbosity : unit -> DataExchangeMessageVerbosity
Return Value
DataExchangeMessageVerbosity
See Also
Reference
IDataConversionMonitor Interface
Autodesk.Revit.DB Namespace